Revit 2027 API
BuiltInFailures.LinkFailures.CannotPublishSharedCoordinatesToMirroredNonRevitLinks Property
 Shared coordinates cannot be published to mirrored, non Revit, links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPublishSharedCoordinatesToMirroredNonRevitLinks { get; }
Public Shared ReadOnly Property CannotPublishSharedCoordinatesToMirroredNonRevitLinks As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPublishSharedCoordinatesToMirroredNonRevitLinks {
	FailureDefinitionId^ get ();
}
static member CannotPublishSharedCoordinatesToMirroredNonRevitLinks : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace